sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_SPI2_Init(void);
static void MX_I2C2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
RF_InitTypeDef RF_InitStruct = {0};
unsigned char NRF24L01_Init (void)
{	
	RF_InitStruct.RF_Power_State=RF_Power_On;
	RF_InitStruct.RF_Config=RF_Config_IRQ_RX_Off|RF_Config_IRQ_TX_Off|RF_Confing_IRQ_Max_Rt_Off;
	RF_InitStruct.RF_CRC_Mode=RF_CRC8_On;
	RF_InitStruct.RF_Mode=RF_Mode_RX;
	RF_InitStruct.RF_Pipe_Auto_Ack=0;	
	RF_InitStruct.RF_Enable_Pipe=1;	
	RF_InitStruct.RF_Setup=RF_Setup_5_Byte_Adress;
	RF_InitStruct.RF_TX_Power=RF_TX_Power_High;
	RF_InitStruct.RF_Data_Rate=RF_Data_Rate_2Mbs;
	RF_InitStruct.RF_Channel=250;
	
#if IS_HMD
	RF_InitStruct.RF_TX_Adress[0]='C';
	RF_InitStruct.RF_TX_Adress[1]='T';
	RF_InitStruct.RF_TX_Adress[2]='R';
	RF_InitStruct.RF_TX_Adress[3]='L';
	RF_InitStruct.RF_TX_Adress[4]='0';
	RF_InitStruct.RF_RX_Adress_Pipe0[0]='B';
	RF_InitStruct.RF_RX_Adress_Pipe0[1]='A';
	RF_InitStruct.RF_RX_Adress_Pipe0[2]='S';
	RF_InitStruct.RF_RX_Adress_Pipe0[3]='E';
	RF_InitStruct.RF_RX_Adress_Pipe0[4]='1'; //HMD
#endif //IS_HMD

#if IS_CONTROLLER
	RF_InitStruct.RF_TX_Adress[0]='B';
	RF_InitStruct.RF_TX_Adress[1]='A';
	RF_InitStruct.RF_TX_Adress[2]='S';
	RF_InitStruct.RF_TX_Adress[3]='E';
	RF_InitStruct.RF_TX_Adress[4]='1';
	RF_InitStruct.RF_RX_Adress_Pipe0[0]='C';
	RF_InitStruct.RF_RX_Adress_Pipe0[1]='T';
	RF_InitStruct.RF_RX_Adress_Pipe0[2]='R';
	RF_InitStruct.RF_RX_Adress_Pipe0[3]='L';
	RF_InitStruct.RF_RX_Adress_Pipe0[4]='0';
#endif //IS_CONTROLLER

	RF_InitStruct.RF_Payload_Size_Pipe0=32;
	RF_InitStruct.RF_Auto_Retransmit_Count=0;
	RF_InitStruct.RF_Auto_Retransmit_Delay=0;
	return RF_Init(&hspi2, &RF_InitStruct);
}	
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

uint64_t HAL_GetMicros()
{
	uint64_t ticks = HAL_GetTick();
	uint64_t systick = (uint64_t)SysTick->VAL;
	return (ticks * 1000ull) + 1000ull - (systick / 72ul);
}

void HAL_MicroDelay(uint64_t delay)
{
	uint64_t tickstart = 0;	
	tickstart = HAL_GetMicros();
	while((HAL_GetMicros() - tickstart) < delay){}
}

inline uint8_t sgn(float n)
{
	return (n<0?-1:1);
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	switch(GPIO_Pin)
	{
		case IR_SENS0_Pin:
			break;
		case IR_SENS1_Pin:
			break;
		case IR_SENS2_Pin:
			break;
		//case IR_SENS3_Pin: disabled for SWJ-IO
		//	break;
		case IR_SENS4_Pin:
			break;
		case IR_SENS5_Pin:
			break;
		case CTL_BTN0_Pin:
		case CTL_BTN1_Pin:
		case CTL_BTN2_Pin:
		case CTL_BTN3_Pin:
		case CTL_BTN4_Pin:
		case CTL_BTN5_Pin:
		case CTL_BTN6_Pin:
		case CTL_BTN7_Pin:
			LastDigitalChange = HAL_GetTick();
			break;
	}
}


inline void ProcessOwnPacket(USBPacket *pPacket)
{	
	if (lastCommandSequence != pPacket->Header.Sequence) //discard duplicates
	{
		lastCommandSequence = pPacket->Header.Sequence; 
		switch (pPacket->Command.Command)
		{
			case CMD_RAW_DATA:								
				feedRawMode = (RawModes) pPacket->Command.Data.Raw.State;
				break;
			case CMD_VIBRATE:
#if IS_CONTROLLER
				if (pPacket->Command.Data.Vibration.Axis == 0)
				{
					vibrationStopTime0 = ticks + pPacket->Command.Data.Vibration.Duration;
					HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET);							
				}
				else if (pPacket->Command.Data.Vibration.Axis == 1)
				{
					vibrationStopTime1 = ticks + pPacket->Command.Data.Vibration.Duration;
					HAL_GPIO_WritePin(CTL_VIBRATE1_GPIO_Port, CTL_VIBRATE1_Pin, GPIO_PIN_SET);							
				}
#endif //IS_CONTROLLER
				break;
			case CMD_CALIBRATE:
				//manually set sensor offsets
				int sensorId = pPacket->Command.Data.Calibration.Sensor;									
				if (pPacket->Command.Data.Calibration.Command == CALIB_GET)							
				{
					SensorCalibRequest = sensorId;
				}
				else
				{
					for (int i=0; i<3; i++)
					{
						position.Position[i] = 0;
						VelocityVector[i] = 0;
						//AccelVector[i] = 0;
						CompAccelVector[i] = 0;
					}
					if (sensorId == SENSOR_NONE)
						break;
					else if (sensorId == SENSOR_ACCEL)
						eepromData.Accel = pPacket->Command.Data.Calibration;
					else if (sensorId == SENSOR_GYRO)
						eepromData.Gyro = pPacket->Command.Data.Calibration;
					else if (sensorId == SENSOR_MAG)
						eepromData.Mag = pPacket->Command.Data.Calibration;
					eepromSaveTime = ticks + 1000; //save after 1 second
				}
				break;
		}
	}
	pPacket->Header.Type = 0xff;
}

#if IS_CONTROLLER
inline void ForwardRFPacket(USBPacket *pPacket)
{						
	RF_SendPayload(&hspi2, (uint8_t*)pPacket, sizeof(USBPacket));				
}
#endif //IS_CONTROLLER

#if IS_HMD
inline void ForwardUSBPacket(USBPacket *pPacket)
{	
	uint8_t channelIndex = pPacket->Header.Type & 0x0F;
	if (channelIndex < MAX_SOURCE)
	{
		CommChannel *pChannel = &Channels[channelIndex];
		pChannel->lastReceive = now;
		//if (channelIndex == HMD_SOURCE)
		//	pChannel->lastInSequence = pPacket->Header.Sequence - 1;
		if (pChannel->lastInSequence != pPacket->Header.Sequence) //skip duplicates for same channel
		{
			blinkDelay = 100;
			pChannel->lastInSequence = pPacket->Header.Sequence;
			USBD_CUSTOM_HID_SendReport_FS((uint8_t*)pPacket,(uint16_t) sizeof(USBPacket)); //forward incoming					
		}
		else
			return;
	}	
}

inline void BroadcastRFPackets()
{
	//send everything in channel buffer without checking sequence
	for (uint8_t channelIndex=0; channelIndex<MAX_SOURCE; channelIndex++)
	{
		if (!(ChannelStateFlags & (1 << channelIndex))) 
			continue; // skip if channel is empty			
		CommChannel *pChannel = &Channels[channelIndex];
		if (!pChannel->remainingTransmits) 
		{
			// skip if no more to transmit. unlikely to enter here
			memset(&pChannel->lastCommand, 0, sizeof(USBPacket));																				
			ChannelStateFlags &= ~(1 << channelIndex); //clear flags
			continue;
		}
		if (now - pChannel->lastReceive > 10000)
		{
			// skip if timedout. (powered off controller etc)
			memset(&pChannel->lastCommand, 0, sizeof(USBPacket));																				
			ChannelStateFlags &= ~(1 << channelIndex); //clear flags
			continue;
		}
		
		if (!readyToSend)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToSend = ((rfStatus & RF_TX_FIFO_EMPTY_Bit) == RF_TX_FIFO_EMPTY_Bit); //if empty 
		}
		if (readyToSend && pChannel->remainingTransmits > 0 && now > pChannel->nextTransmit)
		{
			readyToSend = false;
			pChannel->nextTransmit = HAL_GetTick() + (rand() % 10); //max 10 ms for retransmit
			//switch to tx mode and send command to device			
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress);
			RF_SendPayload(&hspi2, (uint8_t *)&pChannel->lastCommand, sizeof(USBPacket));
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete
			pChannel->remainingTransmits--;
			if (!pChannel->remainingTransmits)	
			{				
				memset(&pChannel->lastCommand, 0, sizeof(USBPacket));																					
				ChannelStateFlags &= ~(1 << channelIndex); //clear flags
			}
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0);
			break; //send single packet only
		}
	}	
}
#endif //IS_HMD

inline void ForwardPacket(USBPacket *pPacket)
{
#if IS_HMD
	ForwardUSBPacket(pPacket);
#endif //IS_HMD				
#if IS_CONTROLLER				
	ForwardRFPacket(pPacket);
#endif //IS_CONTROLLER				
}

inline void ProcessSensors()
{
	float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
	
