sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
	if (elapsedTime >= 0.005f) //update at 200hz
	{	
		hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
		hasRotationData |= readGyroData(tSensorData.Gyro.Raw); 
		hasRotationData |= readMagData(tSensorData.Mag.Raw);
				
		
		if (hasRotationData) // recalc position if still has position data to be sent
		{
			tSensorData.Accel.ProcessNew();
			tSensorData.Gyro.ProcessNew();
			tSensorData.Mag.ProcessNew();
			
			tSensorData.TimeElapsed = elapsedTime;
			lastRotationUpdate = now;	
			orientQuat = orientFuse.FuseOrient(&tSensorData);						

			//gravQuat = orientQuat;
//				gravQuat.w = 0; gravQuat.x = 0; gravQuat.y = 0; gravQuat.z = 0;
//				gravQuat = (orientQuat * gravQuat) * orientQuat.conjugate();

			if (isPositionReady && (hasPositionData || (isCalibrated && (ticks >= 10000))))
			{
				//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
				//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
				{
					GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
					GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
					GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;
					
					for (int i=0; i<3; i++)
					{
						float prevAccel = CompAccelVector[i];
						float prevVelocity = VelocityVector[i];																									
						float newAccel = tSensorData.Accel.Converted[i] - GravityVector[i];
						float newVelocity = ((prevAccel + newAccel) / 2.0f) * 9.81f * elapsedTime;		
						float prevPosition = position.Position[i];
						
						//if velocity changes direction hold for a moment
//							if (sgn(prevVelocity) != sgn(newVelocity))
//							{
//								newVelocity = prevVelocity = 0;
//								//newAccel = 0;
//							}
						
						
						position.Position[i] = prevPosition + ((prevVelocity + newVelocity) / 2.0f) * elapsedTime * 10.0f;											
						CompAccelVector[i] = newAccel;
						VelocityVector[i] = prevVelocity + newVelocity;							
					}	
					
					//if (now - lastPositionSend >= 20000) //50 ms
					{
						positionQuat.w = 0;
						positionQuat.x = position.Position[0];
						positionQuat.y = position.Position[1];
						positionQuat.z = position.Position[2];
						
						positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
						
						hasPositionData = true;							
						//lastPositionSend = now;	
					}
					
					//lastPositionIntegrateTime = now;
				}
			}
			//else
			//	lastPositionIntegrateTime = now;
		}
	}
}

#if IS_CONTROLLER
inline void ProcessADC()
{
	if (ticks - LastADCChange >= 50) //20 analog values per second
	{				 
		uint8_t changed = 0;
		LastADCChange = ticks;
		ADC_Value[0] = (((float)(ADC_Values[0] + ADC_Values[2]) / 2.0f) * 0.5f) + (ADC_Value[0] * 0.5f);
		ADC_Value[1] = (((float)(ADC_Values[1] + ADC_Values[3]) / 2.0f) * 0.5f) + (ADC_Value[1] * 0.5f);
		
		uint32_t value0 = ((uint32_t)(ADC_Value[0] / 40.96f));
		uint32_t value1 = ((uint32_t)(ADC_Value[1] / 40.96f));
		
		if (ADC_Cache[0] != value0) { changed = 1; ADC_Cache[0] = value0;}				
		if (ADC_Cache[1] != value1) { changed = 1; ADC_Cache[1] = value1;}
		if (changed)
		{
			//if any analog value has changes
			buttonRetransmit = 5;					
			lastButtonRefresh = ticks;
		}
	}
}
#endif //IS_CONTROLLER

inline void CalibrateSensors(void)
{
	for(int i=0; i<3; i++)
	{
		if (eepromData.Accel.Sensor == SENSOR_ACCEL)
		{
			tSensorData.Accel.Offset[i] = (float)(eepromData.Accel.RawMax[i] + eepromData.Accel.RawMin[i]) / 2.0f;			
			//tSensorData.Accel.PosScale[i] = eepromData.Accel.RawMax[i] == 0? 1.0f : (1.0f / aRes) / (float)(eepromData.Accel.RawMax[i] - tSensorData.Accel.Offset[i]);
			//tSensorData.Accel.NegScale[i] = eepromData.Accel.RawMin[i] == 0? 1.0f : (1.0f / aRes) / (float)(eepromData.Accel.RawMin[i] - tSensorData.Accel.Offset[i]);
		}
		if (eepromData.Gyro.Sensor == SENSOR_GYRO)
		{
			tSensorData.Gyro.Offset[i] = (float)(eepromData.Gyro.RawMax[i]);
			tSensorData.Gyro.PosScale[i] = 1.0f;
			tSensorData.Gyro.NegScale[i] = 1.0f;
		}
		if (eepromData.Mag.Sensor == SENSOR_MAG)
		{
			tSensorData.Mag.Offset[i] = (float)(eepromData.Mag.RawMax[i] + eepromData.Mag.RawMin[i]) / 2.0f;			
			//tSensorData.Mag.PosScale[i] = eepromData.Mag.RawMax[i] == 0? 1.0f : (1.0f / mRes) / (float)(eepromData.Mag.RawMax[i] - tSensorData.Mag.Offset[i]);
			//tSensorData.Mag.NegScale[i] = eepromData.Mag.RawMin[i] == 0? 1.0f : (1.0f / mRes) / (float)(eepromData.Mag.RawMin[i] - tSensorData.Mag.Offset[i]);
		}
	}		
	isCalibrated = true;	
}

inline void ResetSensorCalibration()
{
	memset(&eepromData, 0, sizeof(eepromData));	
	tSensorData.ResetCalibration();
	isCalibrated = false;		
}	


/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
#if IS_HMD
	uint16_t usbDescLen = 0;
	uint8_t *usbDesc = USBD_CUSTOM_HID.GetFSConfigDescriptor(&usbDescLen);
	usbDesc[33] = usbDesc[40] = 1;	//1 ms poll interval
#endif //IS_HMD
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_SPI2_Init();
  MX_I2C2_Init();

  /* USER CODE BEGIN 2 */
  
#if IS_HMD
	MX_USB_DEVICE_Init();
#endif //IS_HMD

	DigitalValues = DigitalCache = 0;
	LedOff();	 


	srand(THIS_DEVICE + HAL_GetTick());
	
	//load eeprom calibration data	
	char *eepromBytes = (char *)&eepromData;	
	int addr = 0;
	for (int i=0; i<sizeof(eepromData); i+=sizeof(uint32_t))
	{
		*((uint32_t *)(&eepromBytes[i])) = readEEPROMWord(addr);
		addr += sizeof(uint32_t);
	}
	
	if (eepromData.Magic == VALID_EEPROM_MAGIC)	
		CalibrateSensors();		
	else
		ResetSensorCalibration();
	
	

#if IS_CONTROLLER
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET); 
	BlinkRease(30);
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
	HAL_Delay(250);
#endif //IS_CONTROLLER

	rfStatus = NRF24L01_Init();	
	if (rfStatus == 0x00 || rfStatus == 0xff)
		Error_Handler();
	LedOff();	
	

	sensorStatus = initSensors();		
	if (!sensorStatus)
		Error_Handler();
	LedOff();		
	
#if IS_CONTROLLER
	buttonRefreshTimeout = 250;
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET); 
	BlinkRease(20);
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
	HAL_Delay(100);
#endif //IS_CONTROLLER
	

	tSensorData.Setup(aRes, gRes, mRes);
	
	
